[
  {
    "Coffee Shop Name": "Anvil",
    "Address": "6148 90 Ave NW",
    "Coordinates": [53.525629369817516, -113.42707575767182],
    "Time Visited": "May 2025",
    "What we ordered": "Italian soda and an iced vanilla latte",
    "Vibe":  "It was a bit cramped and noisy at the location if you're looking to do something that requires focus. It's very good for chatting and having fun though",
    "Would I come back?": "Yes!",
    "Seating": "There is some seating but not a ton of space. The tables aren't huge if you're hoping to work on your laptop or study with a friend. However, there's enough space for cups and plates",
    "Wifi": "Unsure",
    "Power Outlet": "Unsure; most tables aren't near a wall and probably wouldn't reach a power outlet anyways",
    "Comments": "Barista was very friendly and nice. We chatted a bit. Our drinks were ready quick. My Italian soda was very tasty. It came with a recyclable bamboo straw. The straw was environmental and actually leaked a little. I liked the leaking because it forced me to savor the drink and take my time. It was like a slow-feeder. The area is decently walkable. There is street parking and shops nearby. It's in a strip mall."
  },
  {
    "Coffee Shop Name": "Aspen",
    "Address": "9951 76 Ave NW",
    "Coordinates": [53.51219049861051, -113.48802321349226],
    "Time Visited": "April 2025",
    "What we ordered": "Guava Italian soda with a Fawkes donut and a seasonal coffee flight",
    "Vibe": "Really good ambiance. It feels comfortable to both chat and work quietly.",
    "Would I come back?": "Yes!",
    "Seating": "Lots of seating and a large space that isn't too cramped. Comfortable chairs and tables that can hold a book or a laptop",
    "Wifi": "Yes",
    "Power Outlet": "Yes",
    "Comments": "The guava syrup was very tasty and I'd get it in my drink again. The coffee flight is so creative with unique flavors! We wish some of the coffee flight drinks were on the regular menu as full-sized drinks. The Earl Grey cream soda was delicious. The prices were average and not too high. It's in a decently walkable location off Whyte ave. One of the flight drinks was a cookie with milk, which sounds fun initially but ultimately is just a glass of milk. Some of the drinks were a bigger hit with us than others."
  },
  {
    "Coffee Shop Name": "Ayco",
    "Address": "10551 Jasper Ave",
    "Coordinates": [53.54085285856467, -113.50236688465634],
    "Time Visited": "February 2025",
    "What we ordered": "Fruit Danish and a tea, as well as a cookie dough doughnut with a drip coffee",
    "Vibe": "Cozy space that has dim lights. It's never too crowded or loud",
    "Would I come back?": "Yes!",
    "Seating": "Lots of seating and the tables are large enough to fit your things. The chairs are comfortable.",
    "Wifi": "Unsure",
    "Power Outlet": "Yes",
    "Comments": "The shop is downtown by Corona station. There are lot of things to do nearby, but if you drove, you'll be met with standard downtown parking (paid). I often see people studying here. The drinks are okay. The star of the show are the pastries, especially croissants. They are unique with lots of variety, and they have trendy items you'd see on TikTok."
  },
  {
    "Coffee Shop Name": "Bar oro",
    "Address": "10550 Jasper Ave",
    "Coordinates": [53.54126176218843, -113.50249744232819],
    "Time Visited": "February 2025",
    "What we ordered": "Ham sandwich and a tea for me, plus a chocolate glazed carrot cake with a latte",
    "Vibe": "Small coffee shop inside a hotel. Very loud and hectic when I went. There wasn't enough seating for everyone and I felt bad for the workers.",
    "Would I come back?": "Unsure",
    "Seating": "There's seating, but it wasn't enough when we went because there were so many people! We only got a table by sheer luck",
    "Wifi": "Unsure",
    "Power Outlet": "Unsure. Either way, this is not a place to go if you're looking to settle down",
    "Comments": "The carrot cake was delicious. If you do go here, be ready to get your order to-go in case there's no seating."
  },
  {
    "Coffee Shop Name": "BE Coffee",
    "Address": "11015 26 Ave NW",
    "Coordinates": [53.45671646558168, -113.51421708465635],
    "Time Visited": "April 2025",
    "What we ordered": "Tea and a cupcake, plus a Honey lavender latte",
    "Vibe": "Very nicely decorated and modern. Cozy, with plenty of seating. It wasn't too busy when we went. They do have a 2-hour seating limit",
    "Would I come back?": "No",
    "Seating": "Comfortable. Plenty of space if you're bringing something to study with, plus a friend",
    "Wifi": "Yes",
    "Power Outlet": "Unsure",
    "Comments": "My tea was okay. The prices are at the higher end for an Edmonton spot at $7+ without tax for some flavored lattes. The honey lavender latte did not taste like honey nor lavender. Then there's my cupcake. It looked amazing on the outside. The cake was fine. The icing was clumpy and somehow tasted like nothing. It wasn't even sweet. If you do go, stick with simple food items and drinks"
  },
  {
    "Coffee Shop Name": "Block 1912",
    "Address": "10361 Whyte Ave NW",
    "Coordinates": [53.51805415329408, -113.49706465824973],
    "Time Visited": "March 2025",
    "What we ordered": "Large latte and a drip coffee", 
    "Vibe": "It embodies Whyte ave. There's exposed brick and nice music. Very inviting, perfect for students",
    "Would I come back?": "Yes!",
    "Seating": "Lots of seating. Most of the tables can fit a laptop.",
    "Wifi": "Yes",
    "Power Outlet": "No",
    "Comments": "The baristas are very friendly. My latte was large and delicious. One day I will try one of their cakes even though they're $15."
  },
  {
    "Coffee Shop Name": "Boxcar",
    "Address": "11926 129 Ave NW",
    "Coordinates": [53.587882017118964, -113.5280782026354],
    "Time Visited": "Summer 2025",
    "What we ordered": "Strawberry latte alongside cinnamon bun with cream (called a Trainwreck). Also a strawberry cold foam matcha with a cookie", 
    "Vibe": "Very stylish",
    "Would I come back?": "Yes",
    "Seating": "The location is very small, cramped, a little busy. When we went, there was lots of wildfire smoke, so we couldn't sit outside. But there was lots of outdoor seating. The tables are a little small if you want to fit a laptop on there.",
    "Wifi": "Yes",
    "Power Outlet": "Unsure",
    "Comments": "The baked goods were very good, same as the drinks. The boxcar theme is cool (themed names for menu items!). There's street parking. Very narrow space in the coffeeshop. You can't look at the menu if there is crowding near the front of the counter."
  },
  {
    "Coffee Shop Name": "Cafe Sole",
    "Address": "9911 72 Ave NW",
    "Coordinates": [53.512117473133245, -113.48887682154732],
    "Time Visited": "Summer 2025",
    "What we ordered": "Churros with Mexican Sole & Iced Dutch cocoa Sole", 
    "Vibe": "Themed, cozy. They sell trinkets and pottery from local artists",
    "Would I come back?": "Yes",
    "Seating": "There is free water (which helps w/ the sweet drinks). Dogs are welcome! Lots of table space. There is also outdoor seating and a nice area to walk around in across the street.",
    "Wifi": "Yes",
    "Power Outlet": "Yes",
    "Comments": "One of the sweetest drinks my companion's had anywhere in Edmonton! Lots of sauce on the churros!! Plus a lot of churro for your money. Drinks come with whipped cream."
  },   
  {
    "Coffee Shop Name": "Carmela's Whisk",
    "Address": "1 Tache St., St. Albert",
    "Coordinates": [53.62948484631094, -113.62853892786607],
    "Time Visited": "July 2025",
    "What we ordered": "Campfire brownie (meringue and graham cracker crust), mango matcha (housemade mango syrup. Good color, layers, chunks of mango, delicious). Raspberry white chocolate scone (incredible! Fresh from the oven, warm, cheaper than average). Ube latte (purple. latte art. doesn't taste like ube much).", 
    "Vibe": "Deep suburb. Feels OK to stick around and work",
    "Would I come back?": "Yes",
    "Seating": "Lots of seating + table space",
    "Wifi": "Yes",
    "Power Outlet": "Yes",
    "Comments": "Drink prices: average. Pastry prices: average-low. Street parking, 2 hr free at the plaza (you have to register your license plate). Saturdays there's a farmer's market. Fun outing but busy."
  },   
  {
    "Coffee Shop Name": "Common Ground",
    "Address": "2727 182 St. SW",
    "Coordinates": [53.41155429515321, -113.63497577598339],
    "Time Visited": "June 2025",
    "What we ordered": "Matcha (good). Wilkd raspberry madeline, almond croissant, almond finger. Iced tiramisu cream latte (a bit small).", 
    "Vibe": "Hostile. Not the kind of place you want to sit at. The vibe of an ergonomic airport. Loud. Cramped.",
    "Would I come back?": "No",
    "Seating": "Not much seating. No tables, just benches.",
    "Wifi": "Unsure",
    "Power Outlet": "Unsure",
    "Comments": "The pastries were really fun. They're small + cheap, you can get a couple (they're each like $3, you can mix & match & share with a friend). Strip mall parking lot. Very busy when we went. It's a bit far for most people."
  },    
  {
    "Coffee Shop Name": "Fawkes",
    "Address": "10137 104 St NW",
    "Coordinates": [53.5420423355556, -113.49904204475608],
    "Time Visited": "February 2025",
    "What we ordered": "Matcha + strawberry donut, matcha rose donut (incredible)", 
    "Vibe": "Popular & lively, antique furniture. You can come and stay for a bit. Nice building.",
    "Would I come back?": "Yes",
    "Seating": "Lots of tables + space",
    "Wifi": "Yes",
    "Power Outlet": "Unsure",
    "Comments": "They have famous donuts. The donuts are a good deal (not as much $ as you'd think). Unique selection of flavors."
  },    
  {
    "Coffee Shop Name": "Felice Cafe",
    "Address": "10930 84St NW",
    "Coordinates": [53.556714843928546, -113.47166947359119],
    "Time Visited": "March 2025",
    "What we ordered": "Rose matcha (had rose petals in it! so fun!); nanaimo bar; seasonal latte; cinnamon bun", 
    "Vibe": "I love Felice Cafe",
    "Would I come back?": "Yes",
    "Seating": "Lots of space! They have an upstairs!",
    "Wifi": "Yes",
    "Power Outlet": "Yes",
    "Comments": "Sometimes a little busy. Near a sketchier area, but good street parking! The seasonal drinks are amazing. The baristas are really nice and they do community events. You get a good amount of drink and the flavors are unique and cool. The cinnamon bun was heated and we think they have an oven, and the icing was browned at the top."
  },    
  {
    "Coffee Shop Name": "Glass Cafe",
    "Address": "10345 107St NW",
    "Coordinates": [53.546188117511484, -113.50429847174038],
    "Time Visited": "March 2025",
    "What we ordered": "Tea; drip coffee; pretzels with dip; breakfast sandwich", 
    "Vibe": "Bright and spacious, trendy",
    "Would I come back?": "No",
    "Seating": "Lots of seating, student-friendly",
    "Wifi": "Yes",
    "Power Outlet": "Yes",
    "Comments": "There was a lot of construction in the area when we made, which made it hard to get to. The worker gave me some difficulties with my order (maybe just a bad day?) Our location was in a school, so you can stay a while and study. Comfortable + good lighting. There's an upstairs! The snacks were a bit more affordable than other coffee shops (they're ready made, not a delicacy but they're fine!)"
  },    
  {
    "Coffee Shop Name": "Gratitude Coffee",
    "Address": "897 Pembina Rd #151, Sherwood Park",
    "Coordinates": [53.564364041735274, -113.2988280066621],
    "Time Visited": "January 2025",
    "What we ordered": "Chai latte; cookie; matcha latte", 
    "Vibe": "Nicely decorated and cozy. Friendly staff",
    "Would I come back?": "Yes",
    "Seating": "Plenty of seating. They even have a reading nook!",
    "Wifi": "Yes",
    "Power Outlet": "Yes",
    "Comments": "Prices were okay! The only downside is they are open at somewhat obscure hours, so it might be hard to make it while they're open. They're in a more remote part of Sherwood Park. Not a walkable area at all. The staff seemed very friendly and nice. There is nice music and books. There were people sitting and working."
  }
]
